n5/src/InformationRegisters/RejectedQuotes/RejectedQuotes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RejectedQuotes</name>
  <resources>
    <name>RejectDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Cause</name>
    <type>
      <types>CatalogRef.QuoteRejects</types>
    </type>
  </resources>
  <dimensions>
    <name>Quote</name>
    <type>
      <types>DocumentRef.Quote</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/RejectedQuotes/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	applyParams ();
	setRejectionDate ();
	if ( causeAlreadyExist () ) then
		Cancel = true;
		Output.RejectionCauseAlreadyExist ();
	endif; 
	
EndProcedure

&AtServer
Procedure applyParams ()
	
	Parameters.Property ( "Quote", Record.Quote );

EndProcedure 

&AtServer
Procedure setRejectionDate ()
	
	Record.RejectDate = CurrentDate ();
	
EndProcedure 

&AtServer
Function causeAlreadyExist ()
	
	s = "
	|select top 1 RejectedQuotes.Cause
	|from InformationRegister.RejectedQuotes as RejectedQuotes
	|where RejectedQuotes.Quote = &Quote
	|";
	q = new Query ( s );
	q.SetParameter ( "Quote", Record.Quote );
	return not q.Execute ().IsEmpty ();
	
EndFunction 

&AtClient
Procedure AfterWrite ( WriteParameters )
	
	Notify ( Enum.MessageQuoteCanceled (), Record.Quote );
	
EndProcedure
